import 'package:flutter/material.dart';

class PrivacyPolicy extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('개인정보처리방침'),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text('''
개인정보 처리방침

마가렛 (이하 ‘회사’라 합니다)은 개인정보보호법에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립 ․ 공개합니다.

개인정보의 수집 및 이용 목적

회사는 다음의 목적을 위하여 개인정보를 수집 및 이용합니다.
가. ‘마가렛’ 서비스의 제공
이용자가 가입한 ‘마가렛’ 서비스 내 상호 식별 및 매칭, 메시지 보내기 등의 기본 서비스 제공
나. 회원 관리
회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별 및 인증, 회원 자격의 유지 및 관리, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리 시 법정대리인의 동의 여부 확인, 분쟁 조정을 위한 기록보존, 각종 고지 ․ 통지, 고충처리 등
다. 신규 서비스 개발 및 마케팅 ․ 광고 활용
신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 이벤트 참여기회 제공 또는 광고성 정보 제공, 접속빈도 파악, 회원의 서비스 이용에 대한 통계 자료 확보 등
라. 서비스 관련 통지
회사가 제공하는 서비스에 관한 정보의 전송

처리하는 개인정보의 항목 및 수집방법

① 회사는 서비스의 원활한 제공을 위하여 다음의 개인정보 항목을 처리하고 있습니다.
가. 필수 항목 : 성명, 성별, 생년월일, 프로필 사진, 거주 지역, 전화번호, 전자우편, SNS계정 정보, 단말기 정보
나. 선택 항목 :
② 서비스 이용 과정 또는 사업처리 과정에서 아래의 정보들이 자동으로 생성되어 수집될 수 있습니다.
IP주소, 쿠키, MAC주소, 방문기록, 서비스 이용 기록, 불량 이용기록 등
③ 회사는 다음의 방법으로 개인정보를 수집합니다.
가. ‘마가렛’프로그램의 실행 또는 사용과정에서의 수집
나. 협력회사로부터의 제공
다. 생성정보 수집 툴을 통한 수집

개인정보의 처리 및 보유 기간

① 회사는 이용자가 서비스 이용계약을 해지하고 계정을 삭제할 때까지 개인정보를 보유 ․ 이용합니다.
②  위 ①항에도 불구하고 다음의 경우에는 각 해당 시점까지 회사가 개인정보를 보유 ․ 이용할 수 있습니다.
가. 관계 법령 위반에 따른 수사 ․ 조사 등이 진행 중인 경우에는 해당 수사 ․ 조사 종료 시까지
나. 서비스 이용에 따른 채권 ․ 채무관계 잔존 시에는 해당 채권 ․ 채무관계 정산 시까지
나. 관련법령에 따른 다음의 기간까지
1) ‘전자상거래 등에서의 소비자 보호에 관한 법률’에 따른 표시 ․ 광고, 계약내용 및 이행 등 거래에 관한 기록
- 표시․광고에 관한 기록 : 6월
- 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년
- 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
2) ‘통신비밀보호법’제41조에 따른 통신사실확인자료 보관
- 가입자 전기통신일시, 개시․종료시간, 상대방 가입자번호, 사용도수, 발신기지국 위치추적자료 : 1년
- 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월
3) 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」시행령 제29조에 따른 본인확인정보 보관 : 게시판에 정보 게시가 종료된 후 6개월

개인정보의 제3자 제공에 관한 사항

① 회사는 정보주체의 개인정보를 제1조에서 정한 목적 범위 내에서만 처리하며, 정보주체의 동의 없이 제3자에게 제공하지 않습니다.
② 회사는 제1조에서 정한 목적을 위하여 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
가. 해당 없음
③ 회사는 위 ①항에도 불구하고 다음의 경우에는 개인정보를 제공할 수 있습니다.
가. 정보주체가 사전에 동의한 경우
나. 법률에 특별한 규정이 있거나 법령상의 의무를 준수하기 위한 경우
다. 수사기관이 수사 목적으로 적정한 절차와 방법에 따라 요구하는 경우
라. 정보주체와의 계약의 체결 및 이행을 위하여 불가피하게 필요한 경우
마. 회사의 새로운 서비스 제공 및 개발을 위하여 필요한 경우
바. 정보주체 또는 그 법정대리인이 의사표시를 할 수 없는 상태에 있거나 주소불명 등으로 사전 동의를 받을 수 없는 경우로서 명백히 정보주체 또는 제3자의 급박한 생명, 신체, 재산의 이익을 위하여 필요하다고 인정되는 경우

개인정보의 파기에 관한 사항

① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 개인정보를 파기합니다.
② 정보주체로부터 동의 받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
가. 파기절차
회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
나. 파기방법
회사는 전자적 파일 형태로 기록 ․ 저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록 ․ 저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.

개인정보처리의 위탁

① 회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
가. 해당 없음
② 회사는 위탁계약 체결시 개인정보 보호법에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적 ․ 관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리 ․ 감톡, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지 감독하고 있습니다.
③ 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체 없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.

개인정보의 안전성 확보 조치

회사는 개인정보의 취급 과정에서 안전성을 확보하기 위하여 다음과 같은 조치를 취하고 있습니다.
가. 개인정보의 암호화
회사는 관련 법률규정 및 내부정책에 따라 개인정보를 암호화하여 안전하게 저장 및 관리하고 있습니다.
나. 해킹 등에 대비한 대책
회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 방지하기 위하여 개인정보의 백업, 최신 백신 프로그램의 사용, 암호화 통신, 침입차단시스템 등의 기술적 조치를 다하고 있습니다.
다. 취급 직원의 최소화 및 교육
회사는 개인정보관련 취급 직원을 담당자에 한정하고, 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 하고 있습니다.
 

개인정보 자동수집 장치의 설치 ․ 운영 및 그 거부

회사는 개인정보 자동 수집 장치(쿠키)를 이용하지 않습니다.

정보주체와 법정대리인의 권리 ․ 의무 및 행사방법

①  정보주체는 회사에 대해 언제든지 개인정보 열람 ․ 정정 ․ 삭제 ․ 처리정지 요구 등을 요청할 수 있습니다.
② 정보주체가 자신의 개인정보를 조회하거나 수정하기 위해서는 애플리케이션 내 ‘설정’을, 처리정지(동의철회)를 위해서는 ‘계정설정>회원탈퇴’를 클릭하여 직접 열람 ․ 정정 및 처리정지(탈퇴)가 가능합니다. 정보주체는 개인정보 관리책임자에게 이메일로 위 ①항의 요청을 할 수 있으며, 이 경우 회사는 지체 없이 조치하도록 하겠습니다.  
③ 정보주체가 회사의 개인정보 처리방침에 동의하지 않는 경우에는 동의를 거부하거나 가입해지(회원탈퇴)를 요청할 수 있으며, 이러한 경우 서비스 이용이 제한됩니다.
④ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다. 
10. 개인정보 보호책임자
① 회사는 개인정보 처리에 관한 업무를 총괄하고, 개인정보 처리와 관려한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
개인정보 보호책임자
성명 : 최현성
직책 : 대표
연락처 : margaret.information@gmail.com 
② 정보주체는 회사의 서비스를 이용하면서 발생한 모든 개인정보 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자로 문의할 수 있으며, 회사는 정보주체의 문의에 대하여 신속한 답변 및 문제 해결을 위해 노력할 것입니다.
11. 적용의 제외
‘마가렛’서비스 내에 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 회사의 개인정보 처리방침이 적용되지 않습니다.
12. 개인정보 처리방침의 변경
① 이 개인정보 처리방침은 2020. 03. 19. 부터 적용됩니다.'''),
        ),
      ),
    );
  }
}
