const contactQuestions = <String>[
  "연락을 종일 하는 편인가요? 아니면 시간날 때 하는 편인가요?",
  "장거리 연애여도 괜찮은가요?",
  "날 잡아서 오래 만나는 것을 선호하나요? 아니면 짧게 자주 만나는 것을 선호하나요?",
  "가까운 곳에서 데이트하는 것을 선호하나요? 아니면 먼 곳에서 데이트하는 것을 선호하나요?",
  "계획적인 데이트를 선호하나요? 아니면 즉흥적인 데이트를 선호하나요?",
];

const datingQuestions = <String>[
  "싸웠을 때 바로 푸는 편인가요? 아니면 시간이 지나고 이성적인 상태에서 푸는 편인가요?",
  "여사친/남사친의 허용범위가 어떻게 되나요?",
  "연인 앞에서 방귀나 트름을 할 수 있나요?",
  "연애와 결혼은 별개인가요?",
  "기념일마다 챙기는 스타일인가요?",
];

const marriageQuestions = <String>[
  "싸웠을 때 바로 푸는 편인가요? 아니면 시간이 지나고 이성적인 상태에서 푸는 편인가요?",
  "여사친/남사친의 허용범위가 어떻게 되나요?",
  "연인 앞에서 방귀나 트름을 할 수 있나요?",
  "연애와 결혼은 별개인가요?",
  "기념일마다 챙기는 스타일인가요?",
];

const characterQuestions = <String>[
  "싸웠을 때 바로 푸는 편인가요? 아니면 시간이 지나고 이성적인 상태에서 푸는 편인가요?",
  "여사친/남사친의 허용범위가 어떻게 되나요?",
  "연인 앞에서 방귀나 트름을 할 수 있나요?",
  "연애와 결혼은 별개인가요?",
  "기념일마다 챙기는 스타일인가요?",
];


const hobbyQuestions = <String>[
  "싸웠을 때 바로 푸는 편인가요? 아니면 시간이 지나고 이성적인 상태에서 푸는 편인가요?",
  "여사친/남사친의 허용범위가 어떻게 되나요?",
  "연인 앞에서 방귀나 트름을 할 수 있나요?",
  "연애와 결혼은 별개인가요?",
  "기념일마다 챙기는 스타일인가요?",
];



const sexQuestions = <String>[
  "성욕이 많은 편인가요?",
  "애인을 위해서 하기 싫은 섹스를 할 수 있나요?",
  "결혼 전에 섹스를 하는 것에 대해서 어떻게 생각하나요?",
  "섹스는 샤워 후에만 하는 편인가요? 분위기 타면 안 씻어도 가능한가요?",
  "성감대가 어디인가요?",
];