const contactQuestions = <String>[
  "연락을 종일하는 편인가요? 시간이 날 때 가끔 하는 편인가요?",
  "장거리 연애여도 괜찮은가요?",
  "장거리 연애와 단거리 연애 중 어느 쪽을 선호하나요?"
      "날 잡아서 오래 만나는 것을 선호하나요? 아니면 짧게 자주 만나는 것을 선호하나요?",
  "가까운 곳에서 데이트하는 것을 선호하나요? 아니면 먼 곳에서 데이트하는 것을 선호하나요?",
  "계획적인 데이트를 선호하나요? 아니면 즉흥적인 데이트를 선호하나요?",
  "장기간(유학, 군대) 떨어져야 하는 연애가 가능한가요?",
];

const datingQuestions = <String>[
  "싸웠을 때 바로 푸는 편인가요? 시간이 지나고 이성적인 상태에서 푸는 편인가요?",
  "애인의 이성친구 허용범위가 어떻게 되나요?",
  "연인 앞에서 방귀나 트름을 할 수 있나요?",
  "연애와 결혼은 별개인가요?",
  "기념일마다 챙기는 스타일인가요?",
];

const marriageQuestions = <String>[
  "결혼 후 자산관리는 어떻게 하는 것이 좋다고 생각하나요?",
  "자녀계획은 어떤가요?",
  "신혼집은 월세에서 시작하는 것이 가능한가요?",
  "성대한 결혼식과 간소한 결혼식 중 어느 쪽을 선호하나요?",
  "자기만의 시간이나 공간이 필요한가요? 모두 오픈 가능한가요?",
];

const characterQuestions = <String>[
  "급한 성격과 여유로운 성격 중 어디에 해당하나요?",
  "욕설이나 비속어를 쓰는 편인가요?",
  "먹는 것에 기쁨을 느끼나요?",
  "집안은 화목한 편인가요?",
  "자존감이 높은 편인가요?",
];

const hobbyQuestions = <String>[
  "취미가 무엇인가요?",
  "패션에 얼마나 신경을 쓰나요?",
  "여행을 즐겨 하나요?",
  "음주와 흡연 여부가 어떻게 되나요?",
  "반려동물을 키우는 것을 좋아하나요?",
];

const sexQuestions = <String>[
  "성욕이 많은 편인가요?",
  "애인을 위해서 하기 싫은 섹스를 할 수 있나요?",
  "결혼 전에 섹스를 하는 것에 대해서 어떻게 생각하나요?",
  "섹스는 샤워 후에만 하는 편인가요? 분위기 타면 안 씻어도 가능한가요?",
  "성감대가 어디인가요?",
];
